Experimento2/Seguridad/LoadTestMinaSamacaAppSeguridad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Plan de Pruebas" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables definidas por el Usuario" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="crearMeasurement" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Controlador Bucle" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">5000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <longProp name="ThreadGroup.start_time">1502718189000</longProp>
        <longProp name="ThreadGroup.end_time">1502718189000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="crearMeausurement" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&quot;sensetime&quot;: &quot;2017-11-13T02:40:14.126Z&quot;, &quot;type&quot;: &quot;temperature&quot;, &quot;dataValue&quot;: 100.0, &quot;unit&quot;: &quot;C&quot;}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.path">/measurements</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="HTTPSampler.implementation">Java</stringProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Gestor de Cabecera HTTP" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiIsImtpZCI6Ik5FTTROVFl4TmpJMk5VWkRPRE15TkRsQk1ERkRSRVpDTmpFeVFrRkdSVFUxUkRkQk5FTXdPQSJ9.eyJpc3MiOiJodHRwczovL2FycXVpc29mdDIwMTcyMC1qYWJlcm11ZGV6MTAuYXV0aDAuY29tLyIsInN1YiI6Ik5rN2VwNEN5ZEpaanM5cDNZcU9iNjdKNlotdng1YzlZQGNsaWVudHMiLCJhdWQiOiJ1bmlhbmRlcy5lZHUuY28vdGhlcm1hbGNvbWZvcnQiLCJpYXQiOjE1MTA1NDU3NDEsImV4cCI6MTUxMDYzMjE0MSwiZ3R5IjoiY2xpZW50LWNyZWRlbnRpYWxzIn0.no6LUypwm7nF_pN9cZ8y3HWN_ePdP-TiqCgU5eJuE6m2kvRFjBvRVk_IoYooI_Qdu8HAwqB0IEyO_JxQrB_-Os8fU8P5MSESgRVi2fimxHQJo4uAE2mDEqeF2lCgigHhNjisyTAXsftMQCfs22EyAquaP3MVBF3OmyVTais_wKtAYM2wax8F9S07AjpodDXLLEWQpeuYsLevxzXPY38DuK-uXht5GzooXahZTjqUcee-yLK_mAq8V4iFHGX-se_roX3MfTe6i48zlfoObcco4TRt2LNyrKkcAqAaSVoyF-WeCZS5kNK5_ysgs1rMZB3jrCCv6A-XX6CIP84UiTkUXA</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="Ver Resultados en Árbol" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Reporte resumen" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>